docs/doc-notes/bello-2019-fuzzy-activ.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-13 Mon 11:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Alexander Brown" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href=" ./style.css" />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a> | <a href="blog.html">Blog</a> | <a href="notes.html">Notes</a> | <a href="classes.html">Classes</a> | <a href="projects.html">Projects</a> | <a href="todo.html">Todo</a> | <a href="error.html">About</a>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgac8011d">1. Fuzzy activation of rough cognitive ensembles using owa operators, Bello, M., Gonzalo N\'apoles, Fuentes, I., Grau, I., Falcon, R., Bello, R., &amp; Vanhoof, K., , (2019)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="inbook">inbook</span></span></a></li>
<li><a href="#org0946b8f">2. Notes</a>
<ul>
<li><a href="#orgbe1e91d">2.1. Abstract</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgac8011d" class="outline-2">
<h2 id="orgac8011d"><span class="section-number-2">1.</span> Fuzzy activation of rough cognitive ensembles using owa operators, Bello, M., Gonzalo N\'apoles, Fuentes, I., Grau, I., Falcon, R., Bello, R., &amp; Vanhoof, K., , (2019)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="inbook">inbook</span></span></h2>
<div class="outline-text-2" id="text-1">
<p>
See <a href="&amp;bello-2019-fuzzy-activ">&amp;bello-2019-fuzzy-activ</a>
</p>
</div>
</div>

<div id="outline-container-org0946b8f" class="outline-2">
<h2 id="org0946b8f"><span class="section-number-2">2.</span> Notes</h2>
<div class="outline-text-2" id="text-2">
<p>
Section of interest: Fully Fuzzy Linear Programming Modelfor the Berth Allocation Problem with Two Quays
</p>
</div>

<div id="outline-container-orgbe1e91d" class="outline-3">
<h3 id="orgbe1e91d"><span class="section-number-3">2.1.</span> Abstract</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Triangular fuzzy numbers represent the imprecision of the arrivals</li>
<li>There are many types of uncertainty such as the randomness, imprecision (ambiguity, vagueness), and confusion, that can be categorized either stochastic or fuzzy [24]. Since the fuzzy sets are specially designed to deal with imprecision, they were selected for the present work.</li>
<li>The administrators of MCT continuously review and change the plans, but a frequent review of the berthing plan is not a desirable thing from a planning of resources point of view. Therefore, the capacity of adaptation of the berthing plan is important for a good system performance that a MCT manages. As a result, a robust model providing a berthing plan that supports the possible imprecision (earliness or lateness) in the arrival time of vessels and easily adaptable is desirable.</li>
<li>In the static case, all the vessels are assumed to be at the port before performing the berthing plan while for the dynamical case, the vessels can arrive to the port at different times during the planning horizon. In [1], the authors make an exhaustive review of the current existing literature about BAP. To our knowledge, there are very few studies dealing with BAP and with imprecise (fuzzy) data.
<ul class="org-ul">
<li>Does this mean that the PAP is based of the dynamic BAP?</li>
</ul></li>
<li>In [23], the uncertainty is dealed with probabilities, that is, it is supposed that historical data are available to obtain the distribution of probability of arrival for each vessel. In many ports there is not enough data available to obtain these distributions.
<ul class="org-ul">
<li>Fuzzy is helpful in the sense that distribution functions do not necessarily need to be known</li>
</ul></li>
<li>Problem description in the BAP case may be helpful in describing the PAP case</li>
<li>Use the models as supporting evidence for the construction</li>
<li>Can build on the model using more "sophisticated" methods of constructing the model</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alexander Brown</p>
<p class="date">Created: 2023-03-13 Mon 11:06</p>
</div>
</body>
</html>
